In [3]:
import mysql.connector as connection
import pandas as pd
import mysql

In [4]:
mydb = mysql.connector.connect(
    host="34.16.84.34",
    user="root",
    passwd="123Qaz456$$D8",
    database="classicmodels"
)

In [5]:
query = "SELECT * FROM classicmodels.payments;"

In [6]:
df = pd.read_sql(query, mydb)
mydb.close()

C:\Users\GGudino\AppData\Local\Temp\ipykernel_19068\1541723352.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, mydb)

In [7]:
df.head()

   customerNumber checkNumber paymentDate    amount
0             103    HQ336336  2004-10-19   6066.78
1             103    JM555205  2003-06-05  14571.44
2             103    OM314933  2004-12-18   1676.14
3             112    BO864823  2004-12-17  14191.12
4             112     HQ55022  2003-06-06  32641.98

In [8]:
df.shape

(273, 4)

In [9]:
df.columns

Index(['customerNumber', 'checkNumber', 'paymentDate', 'amount'], dtype='object')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 273 entries, 0 to 272
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customerNumber  273 non-null    int64
 1   checkNumber     273 non-null    object
 2   paymentDate     273 non-null    object
 3   amount          273 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 8.7+ KB

In [12]:
df.describe()

       customerNumber         amount
count      273.000000     273.000000
mean       271.194139   32431.645531
std        120.069507   20997.116917
min        103.000000     615.450000
25%        161.000000   16909.840000
50%        250.000000   32077.440000
75%        363.000000   45352.470000
max        496.000000  120166.580000

In [14]:
df["amount"].dtype

dtype('float64')

In [17]:
df[df["customerNumber"] == 103]

   customerNumber checkNumber paymentDate    amount
0             103    HQ336336  2004-10-19   6066.78
1             103    JM555205  2003-06-05  14571.44
2             103    OM314933  2004-12-18   1676.14

In [16]:
df[df["customerNumber"] == 103]["paymentDate"]

0    2004-10-19
1    2003-06-05
2    2004-12-18
Name: paymentDate, dtype: object

In [19]:
df[(df["customerNumber"] == 103) | (df["amount"] >= 2000)]

     customerNumber checkNumber paymentDate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
268             495    BH167026  2003-12-26  59265.14
269             495    FN155234  2004-05-14   6276.60
270             496    EU531600  2005-05-25  30253.75
271             496    MB342426  2003-07-16  32077.44
272             496     MN89921  2004-12-31  52166.00

[266 rows x 4 columns]